In [1]:
import pandas as pd
import numpy as np

In [1]:
##### Series class

In [ ]:
## Series 생성하기

In [2]:
series = pd.Series(["하나", "둘", "셋", "넷", "다섯", "여섯", "일곱", "여덟", "아홉", "열"],
                   index = [_ for _ in range(1, 11)])
series

# 시리즈의 S는 대문자!!

1     하나
2      둘
3      셋
4      넷
5     다섯
6     여섯
7     일곱
8     여덟
9     아홉
10     열
dtype: object

In [3]:
s = pd.Series([9_904_312, 3_448_737, 2_890_451, 2_466_052],
              index = ["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [4]:
# Q1. 10, 20, ..., 90의 값을 갖는 Series 생성하기
ser = pd.Series([_ for _ in range(10, 91, 10)],
                index = [_ for _ in range(9)])
ser

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [5]:
# Q1 다른 풀이
test = pd.Series(list(range(10, 100, 10)))
test

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [6]:
pd.Series(range(10, 14))

# index 인수를 생략하면 0부터 시작함 (Default)

0    10
1    11
2    12
3    13
dtype: int64

In [7]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [8]:
type(s.index)

pandas.core.indexes.base.Index

In [9]:
print(s.values)
print(type(s.values))

[9904312 3448737 2890451 2466052]
<class 'numpy.ndarray'>

In [10]:
pd.Series()
# 값이 없어서 어떻게 구성할지 모르겠다는 경고 메시지

C:\Users\Playdata\AppData\Local\Temp\ipykernel_5204\3377863825.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  pd.Series()

Series([], dtype: float64)

In [11]:
# Q2. Q1에서 만든 Series 객체 값 중 50보다 큰 값의 개수?
val = np.array([True if test[i] > 50 else False for i in range(len(test))])

print(val)
print(sum(val == True))

[False False False False False  True  True  True  True]
4

In [12]:
# Q2 풀이
print(test.values > 50)
print(sum(test.values > 50))

[False False False False False  True  True  True  True]
4

In [ ]:
## 이름 붙이기

In [13]:
s.name = "인구"
s.index.name = "도시"
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [39]:
## 딕셔너리 사용

In [14]:
d = {"a": 1, "b": 2, "c": 3}
ser = pd.Series(data = d, index = ["c", "a", "b"])
ser

# index가 value의 순서대로 출력됨

c    3
a    1
b    2
dtype: int64

In [15]:
d = {"a": 1, "b": 2, "c": 3}
ser = pd.Series(data = d, index = ["c", "a", "b1"])
ser

# Key에 없는 값을 입력하면 NaN이 출력됨
# NaN은 자료형은 float64이다. (= 결측치의 자료형은 float이구나! 기억해둘 것)

c     3.0
a     1.0
b1    NaN
dtype: float64

In [16]:
d = {'a': 1, 'b': 2, 'c': 3}
ser = pd.Series(data = d, index = ['x', 'y', 'z'])
ser

# x, y, z에 해당하는 데이터가 없으므로 NaN이 출력됨
# dict의 Key와 index를 잘

x   NaN
y   NaN
z   NaN
dtype: float64

In [17]:
s2 = pd.Series({"서울": 9_904_312,
                "부산": 3_448_737,
                "인천": 2_890_451,
                "대구": 2_466_052})
s2

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [18]:
# Q3.
soc = {"철수": 88, "영희": 95, "길동": 100, "몽룡":67}
ser = pd.Series(data = soc, index = ["철수", "영희", "길동", "몽룡"])
ser

철수     88
영희     95
길동    100
몽룡     67
dtype: int64

In [19]:
# Q3 풀이
scores = {"철수": 88, "영희": 95, "길동": 100, "몽룡":67}
s_scores = pd.Series(scores)
s_scores

철수     88
영희     95
길동    100
몽룡     67
dtype: int64

In [49]:
# index

In [20]:
d = {'a': 1, 'b': 2, 'c': 3}
ser = pd.Series(data = d, index = ['a', 'b', 'c'])
ser

a    1
b    2
c    3
dtype: int64

In [21]:
ser.a, ser.b, ser.c

(1, 2, 3)

In [22]:
"서울" in s  # Key에 대해서만 찾는다

True

In [23]:
"대전" in s

False

In [24]:
9904312 in s  # value에 대해서는 .values()로 찾는다

False

In [26]:
9_904_312 in s.values  # Series에는 괄호를 붙이지 않는다!!

True

In [27]:
test = dict(zip(range(10), list("영일이삼사오육칠팔구")))

In [28]:
for k, v in test.items():
    print(f'{k}, {v}')

0, 영
1, 일
2, 이
3, 삼
4, 사
5, 오
6, 육
7, 칠
8, 팔
9, 구

In [29]:
"영" in test

False

In [30]:
"영" in test.values()

True

In [31]:
s = pd.Series([9_904_312, 3_448_737, 2_890_451, 2_466_052],
              index = ["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [32]:
# Q4.
for i, j in s.items():
    if j > 3000000:
        print(f'{i}의 인구는 300만이 넘습니다.')

서울의 인구는 300만이 넘습니다.
부산의 인구는 300만이 넘습니다.

In [ ]:
## Series 연산

In [69]:
# 연산은 value에만 적용되고, index값을 바꿔주지는 않는다.

In [33]:
print(s)

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [34]:
print(s / 100000)

서울    99.04312
부산    34.48737
인천    28.90451
대구    24.66052
dtype: float64

In [ ]:
## Series 인덱싱

In [35]:
s[1], s["부산"]

(3448737, 3448737)

In [36]:
s[3], s["대구"]

(2466052, 2466052)

In [37]:
s[[0, 3, 1]]

서울    9904312
대구    2466052
부산    3448737
dtype: int64

In [38]:
s[["서울", "대구", "부산"]]

서울    9904312
대구    2466052
부산    3448737
dtype: int64

In [39]:
s[[0]]  # 하나의 값만 입력해도 시리즈 형태로 출력됨

서울    9904312
dtype: int64

In [40]:
# Q5.
s[[2]]

인천    2890451
dtype: int64

In [41]:
# Q5 다른 풀이
s[["인천"]]

인천    2890451
dtype: int64

In [81]:
## Series 슬라이싱

In [42]:
s[1:3]  # s[1], s[2]만 출력

부산    3448737
인천    2890451
dtype: int64

In [43]:
s["부산": "대구"]  # 부산부터 대구까지 모두 출력 (사잇값 포함)

부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [84]:
## Series index 기반 연산

In [44]:
# 2015년 인구
s = pd.Series([9_904_312, 3_448_737, 2_890_451, 2_466_052],
              index = ["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [45]:
# 2010년 인구
s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158})
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [46]:
ds = s - s2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [47]:
ds.isnull()  # ds 안에 해당 값이 NaN이면 True

대구     True
대전     True
부산    False
서울    False
인천    False
dtype: bool

In [48]:
ds.notnull()  # ds 안에 해당 값이 NaN이면 False

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [49]:
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [93]:
## 결측값 제외하고 인덱싱으로 구하기

In [50]:
# 결측값 배제, '10년 대비 '15년 인구 증가율
rs = (s - s2) / s2 * 100
rs

대구         NaN
대전         NaN
부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [51]:
rs.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [52]:
rs[rs.notnull()]

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [53]:
# Q6. 인구수 증가가 가장 많은 도시의 이름과 증가한 인구 수?
rs = s - s2
rs

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [55]:
rs = rs[rs.notnull()]
rs

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [56]:
rs[[rs.argmax()]]

서울    272830.0
dtype: float64

In [57]:
# Q6 다른 풀이
rs = s - s2
rs[[rs.argmax()]]

서울    272830.0
dtype: float64

In [112]:
### 추가, 갱신, 삭제

In [58]:
a = dict(zip(range(10), list("영일이삼사오육칠팔구")))

In [59]:
a[0] = "zero"
a  # 갱신 완료

{0: 'zero',
 1: '일',
 2: '이',
 3: '삼',
 4: '사',
 5: '오',
 6: '육',
 7: '칠',
 8: '팔',
 9: '구'}

In [60]:
rs["부산"] = 1.63
rs

대구          NaN
대전          NaN
부산         1.63
서울    272830.00
인천    258416.00
dtype: float64

In [61]:
rs = (s - s2) / s2 * 100
rs

대구         NaN
대전         NaN
부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [62]:
rs = rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [63]:
rs["부산"] = 1.63
rs

부산    1.630000
서울    2.832690
인천    9.818107
dtype: float64

In [64]:
# Q7. Series 객체 값 수정
rs["서울"], rs["인천"] = 2.83, 9.82
rs

부산    1.63
서울    2.83
인천    9.82
dtype: float64

In [65]:
# Q7 - 슬라이싱 활용
rs["서울":"인천"] = 2.83, 9.82  # 소괄호 써도 되고 생략해도 됨
rs

부산    1.63
서울    2.83
인천    9.82
dtype: float64

In [66]:
rs["대구"] = 1.41
rs  # 대구 추가

부산    1.63
서울    2.83
인천    9.82
대구    1.41
dtype: float64

In [67]:
del rs["서울"]
rs  # 서울 삭제

부산    1.63
인천    9.82
대구    1.41
dtype: float64

In [68]:
# Q8. Series 객체 ser_finance1, ser_finance2 만들기
fin1 = {"카카오": 60010, "삼성전자": 61000, "LG전자": 90000}
fin2_value = [60200, 61200, 200100]
fin2_index = ["카카오", "삼성전자", "네이버"]

ser_finance1 = pd.Series(data = fin1.values(), index = fin1.keys())
ser_finance1

카카오     60010
삼성전자    61000
LG전자    90000
dtype: int64

In [69]:
ser_finance2 = pd.Series(data = fin2_value, index = fin2_index)
ser_finance2

카카오      60200
삼성전자     61200
네이버     200100
dtype: int64

In [70]:
# Q8 풀이
fin1 = {"카카오": 60010, "삼성전자": 61000, "LG전자": 90000}
fin2_value = [60200, 61200, 200100]
fin2_index = ["카카오", "삼성전자", "네이버"]

ser_finance1 = pd.Series(fin1)
ser_finance2 = pd.Series(fin2_value, fin2_index)

print(ser_finance1)
print(ser_finance2)

카카오     60010
삼성전자    61000
LG전자    90000
dtype: int64
카카오      60200
삼성전자     61200
네이버     200100
dtype: int64

In [71]:
# Q9. 해당 dtype(float)이 나오는 이유?  - 나눗셈 연산 빼고는 모르겠다...
print(ser_finance1 - ser_finance2)

LG전자      NaN
네이버       NaN
삼성전자   -200.0
카카오    -190.0
dtype: float64

In [72]:
print(ser_finance1 + ser_finance2)  # type(np.nan)이 float라서.

LG전자         NaN
네이버          NaN
삼성전자    122200.0
카카오     120210.0
dtype: float64

In [73]:
print(ser_finance1 * ser_finance2)

LG전자             NaN
네이버              NaN
삼성전자    3.733200e+09
카카오     3.612602e+09
dtype: float64

In [74]:
print(ser_finance1 / ser_finance2)  # 나누기 연산이니 당연히 float

LG전자         NaN
네이버          NaN
삼성전자    0.996732
카카오     0.996844
dtype: float64

In [75]:
# Q10. NaN이 없게 Series 객체 출력 - 인덱싱 활용
result = ser_finance1 - ser_finance2
result[[2, 3]]

삼성전자   -200.0
카카오    -190.0
dtype: float64

In [76]:
# Q10 풀이
result = ser_finance1 - ser_finance2
result[result.notnull()]

삼성전자   -200.0
카카오    -190.0
dtype: float64

In [175]:
##### Data Frame

In [77]:
d = {'col1': [1, 2], 'col2': [3, 4]}
df = pd.DataFrame(data = d)
df

   col1  col2
0     1     3
1     2     4

In [78]:
data = {
    "2015" : [9904312, 3448737, 2890451, 2466052],
    "2010" : [9631482, 3393191, 2632035, 2431774],
    "2005" : [9762546, 3512547, 2517680, 2456016],
    "2000" : [9853972, 3655437, 2466338, 2473990],
    "지역" : ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율" :[0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index = index, columns = columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [79]:
df.dtypes  # 모든 열에 대해 dtype 출력  -> 복수형 s가 붙음

지역                object
2015               int64
2010               int64
2005               int64
2000               int64
2010-2015 증가율    float64
dtype: object

In [80]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [81]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [82]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [83]:
df.index.name = "도시"
df.columns.name = "특성"
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [193]:
## 직접 데이터 수집 -> Data frame 제작

In [84]:
epl_TOP_15 = {
    "팀" : ["아스널", "맨시티", "맨유", "토트넘", "리버풀", "뉴캐슬", "풀럼", "브라이튼",
           "브랜트포드", "첼시", "아스톤 빌라", "크리스탈 팰리스", "울버햄튼", "노팅엄", "레스터"],
    "승점" : [63, 58, 49, 45, 42, 41, 39, 38, 35, 34, 34, 27, 27, 26, 24],
    "승" : [20, 18, 15, 14, 12, 10, 11, 11, 8, 9, 10, 6, 7, 6, 7],
    "무" : [3, 4, 4, 3, 6, 11, 6, 5, 11, 7, 4, 9, 6, 8, 3],
    "패" : [3, 4, 6, 9, 7, 3, 8, 7, 4, 9, 11, 10, 13, 11, 15],
    "득실차" :[34, 41, 6, 10, 19, 18, 5, 14, 7, -1, -7, -11, -16, -24, -7],
    "승률" : [20/26, 18/26, 15/25, 14/26, 12/25, 10/24, 11/25, 11/23, 8/23, 9/25, 10/25, 6/25,
            7/26, 6/25, 7/25]}

columns = ["팀", "승점", "승", "무", "패", "득실차", "승률"]
index = [_ for _ in range(1, 16)]
epl_df = pd.DataFrame(epl_TOP_15, index = index, columns = columns)
epl_df

           팀  승점   승   무   패  득실차        승률
1        아스널  63  20   3   3   34  0.769231
2        맨시티  58  18   4   4   41  0.692308
3         맨유  49  15   4   6    6  0.600000
4        토트넘  45  14   3   9   10  0.538462
5        리버풀  42  12   6   7   19  0.480000
6        뉴캐슬  41  10  11   3   18  0.416667
7         풀럼  39  11   6   8    5  0.440000
8       브라이튼  38  11   5   7   14  0.478261
9      브랜트포드  35   8  11   4    7  0.347826
10        첼시  34   9   7   9   -1  0.360000
11    아스톤 빌라  34  10   4  11   -7  0.400000
12  크리스탈 팰리스  27   6   9  10  -11  0.240000
13      울버햄튼  27   7   6  13  -16  0.269231
14       노팅엄  26   6   8  11  -24  0.240000
15       레스터  24   7   3  15   -7  0.280000

In [85]:
df.T  # 전치

도시                  서울       부산       인천       대구
특성
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

In [ ]:
## 갱신

In [86]:
df["2010-2015 증가율"] = df["2010-2015 증가율"] * 100
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [87]:
type(df["2010-2015 증가율"])  # Series

pandas.core.series.Series

In [209]:
## 열 추가

In [88]:
df["2005-2010 증가율"] = ((df["2010"] - df["2005"]) / df["2005"] * 100).round(2)
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2456016  2473990           1.41          -0.99

In [211]:
## 열 삭제

In [89]:
del df["2010-2015 증가율"]
df

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

In [213]:
## 인덱싱

In [90]:
df["2010"]

도시
서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64

In [91]:
type(df["2010"])

pandas.core.series.Series

In [92]:
partial = df[["2010", "2015"]]
partial  # 일부 열을 인덱싱하면 부분적인 Data frame이 출력된다

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [93]:
type(partial)

pandas.core.frame.DataFrame

In [94]:
df[0]  # 정수 인덱스 활용 불가 -> KeyError 발생

KeyError: 0

In [95]:
df2 = pd.DataFrame(np.arange(12).reshape(3, 4))
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [96]:
df2[2]  # 원래 Key가 정수인 경우에는 인덱싱 가능

0     2
1     6
2    10
Name: 2, dtype: int32

In [97]:
df2[[1, 2]]

   1   2
0  1   2
1  5   6
2  9  10

In [229]:
## row 슬라이싱

In [98]:
df[1:2]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437           -3.4

In [99]:
df["부산":"부산"]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437           -3.4

In [100]:
df["서울"]  # KeyError 발생

# '서울'이라는 것을 column에서 찾으므로(찾아봤자 없으니까) 에러 발생

KeyError: '서울'

In [ ]:
## 개별데이터 인덱싱

In [ ]:
# df_name[column_label][row_label]

In [101]:
df["2015"]["서울"]

9904312

In [234]:
# Q. row_label을 먼저 인덱싱할 수는 없을까
# A. 가능은 하지만 비효율적

In [102]:
df["서울"]["2015"]  # KeyError 발생

KeyError: '서울'

In [103]:
df["서울":"서울"]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34

In [104]:
df["서울":"서울"]["2015"]

도시
서울    9904312
Name: 2015, dtype: int64

In [105]:
type(df["서울":"서울"]["2015"])

pandas.core.series.Series

In [106]:
# 연습문제
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)

In [107]:
# (1) 모든 학생의 수학 점수를 Series로
ser = pd.Series(data["수학"])
ser

0    90
1    60
2    80
3    70
dtype: int64

In [108]:
# 더 간단히
df["수학"]

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [109]:
# (2) 모든 학생의 국어, 영어 점수를 Data frame으로
kor_eng = df[["국어", "영어"]]
kor_eng

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [110]:
# 더 간단히
df[["국어", "영어"]]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [111]:
# (3) 모든 학생의 각 과목 평균점수 열 추가
df["평균"] = (df["국어"] + df["영어"] + df["수학"]) / 3
df

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  40  70  46.666667

In [112]:
# (4) 춘향의 점수 Data frame으로
df[0:1]

    국어  영어  수학         평균
춘향  80  90  90  86.666667

In [113]:
# 더 간단히
df[:1]

    국어  영어  수학         평균
춘향  80  90  90  86.666667

In [114]:
# (5) 향단의 점수 Series로  (의외로 오래걸림)
df.T["향단"]

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

In [115]:
# Q. 연습문제2
np.random.seed(0)

data = {
    "A": np.random.randn(6),
    "B": np.random.randn(6),
    "C": np.random.randn(6),
    "D": np.random.randn(6)
}

columns = ["A", "B", "C", "D"]
index = pd.date_range("20130226", periods = 6)
df = pd.DataFrame(data, index = index, columns = columns)

df

                   A         B         C         D
2013-02-26  1.764052  0.950088  0.761038  0.313068
2013-02-27  0.400157 -0.151357  0.121675 -0.854096
2013-02-28  0.978738 -0.103219  0.443863 -2.552990
2013-03-01  2.240893  0.410599  0.333674  0.653619
2013-03-02  1.867558  0.144044  1.494079  0.864436
2013-03-03 -0.977278  1.454274 -0.205158 -0.742165

In [116]:
# 연습문제2 풀이
np.random.seed(0)
dates = pd.date_range("2013-02-26", periods = 6)
print(dates)

df = pd.DataFrame(np.random.randn(6, 4), index = dates, columns = list("ABCD"))
df

DatetimeIndex(['2013-02-26', '2013-02-27', '2013-02-28', '2013-03-01',
               '2013-03-02', '2013-03-03'],
              dtype='datetime64[ns]', freq='D')

                   A         B         C         D
2013-02-26  1.764052  0.400157  0.978738  2.240893
2013-02-27  1.867558 -0.977278  0.950088 -0.151357
2013-02-28 -0.103219  0.410599  0.144044  1.454274
2013-03-01  0.761038  0.121675  0.443863  0.333674
2013-03-02  1.494079 -0.205158  0.313068 -0.854096
2013-03-03 -2.552990  0.653619  0.864436 -0.742165